//========================================================================================
//  
//  $File: //depot/devtech/16.0.x/plugin/source/sdksamples/common/SDKInfoButton.r $
//  
//  Owner: Adobe Developer Technologies
//  
//  $Author: pmbuilder $
//  
//  $DateTime: 2020/11/06 13:08:29 $
//  
//  $Revision: #2 $
//  
//  $Change: 1088580 $
//  
//  Copyright 1997-2010 Adobe Systems Incorporated. All rights reserved.
//  
//  NOTICE:  Adobe permits you to use, modify, and distribute this file in accordance 
//  with the terms of the Adobe license agreement accompanying it.  If you have received
//  this file from a source other than Adobe, then your use, modification, or 
//  distribution of it requires the prior written permission of Adobe.
//  
//  
//  This is the resource file that provides the Rez declarations for the Adobe
//  info button icon. 
//  
//========================================================================================

#include "SDKDef.h"

#ifdef MACINTOSH
// Macintosh specific resources: ---------------------------------------------------------

	#include <CoreServices/CoreServices.r>

	data 'ics#' (kSDKDefIconInfoResourceID, "iconInfo")
	{
		$"0FE0 1C78 301C 600C C186 C006 C786 C186"            /* .à.x0.`.Á†À.Ç†Á† */
		$"C186 C186 618C 701C 3FF8 0FE0 0000 0000"            /* Á†Á†aŒp.?ø.à.... */
		$"0FE0 1FF8 3FFC 7FFC FFFE FFFE FFFE FFFE"            /* .à.ø?ü.üÿþÿþÿþÿþ */
		$"FFFE FFFE 7FFC 7FFC 3FF8 0FE0 0000 0000"            /* ÿþÿþ.ü.ü?ø.à.... */
	};

	data 'icm#' (kSDKDefIconInfoResourceID, "iconinfo")
	{
		$"0FE0 1C78 301C 600C C186 C006 C786 C186"            /* .à.x0.`.Á†À.Ç†Á† */
		$"C186 C186 618C 701C 0FE0 1FF8 3FFC 7FFC"            /* Á†Á†aŒp..à.ø?ü.ü */
		$"FFFE FFFE FFFE FFFE FFFE FFFE 7FFC 7FFC"            /* ÿþÿþÿþÿþÿþÿþ.ü.ü */
	};

	data 'icm4' (kSDKDefIconInfoResourceID, "iconinfo")
	{
		$"CCCD EEFF FEED CCC0 CCDE EEDD DEEF ECC0"            /* ÌÍîÿþíÌÀÌÞîÝÞïìÀ */
		$"CDEE DCCC CCDE FEC0 DEED CCCD CCCD EFD0"            /* ÍîÜÌÌÞþÀÞíÌÍÌÍïÐ */
		$"EEDC CCCF ECCC DFE0 FEDC CCCD CCCC DEF0"            /* îÜÌÏìÌßàþÜÌÍÌÌÞð */
		$"FEDC CEFF ECCC DEF0 FEDC CCDF ECCC DEF0"            /* þÜÎÿìÌÞðþÜÌßìÌÞð */
		$"FEDC CCDF ECCC DEF0 EEDD CCDF ECCD DEE0"            /* þÜÌßìÌÞðîÝÌßìÍÞà */
		$"DEED DCDF ECDD EFD0 CEEE DDDD DDDE FEC0"            /* ÞíÜßìÝïÐÎîÝÝÝÞþÀ */
	};

	data 'icm8' (kSDKDefIconInfoResourceID, "iconinfo")
	{
		$"2B2B 2B56 FBFB FFFF FFFF FB56 2B2B 2B00"            /* +++VûûÿÿÿÿûV+++. */
		$"2B2B F9FB FFFB F9F9 F9FB FBFF FB2B 2B00"            /* ++ùûÿûùùùûûÿû++. */
		$"2BF9 FFFB 562B 2B2B 2B2B 56FB FFFB 2B00"            /* +ùÿûV+++++Vûÿû+. */
		$"56FB FB56 2B2B 2BF9 F82B 2B56 FBFF 5600"            /* VûûV+++ùø++VûÿV. */
		$"FBFF F92B 2B2B F8FF FB2B 2B2B F9FF FB00"            /* ûÿù+++øÿû+++ùÿû. */
		$"FFFB F92B 2B2B 2B56 F82B 2B2B F9FB FF00"            /* ÿûù++++Vø+++ùûÿ. */
		$"FFFB 562B 2BFB FFFF FB2B 2B2B 56FB FF00"            /* ÿûV++ûÿÿû+++Vûÿ. */
		$"FFFB 562B 2B2B 56FF FB2B 2B2B 56FB FF00"            /* ÿûV+++Vÿû+++Vûÿ. */
		$"FFFB F92B 2B2B 56FF FB2B 2B2B F9FB FF00"            /* ÿûù+++Vÿû+++ùûÿ. */
		$"FBFB F956 2B2B 56FF FB2B 2B56 F9FF FB00"            /* ûûùV++Vÿû++Vùÿû. */
		$"56FF FBF9 562B 56FF FB2B 56F9 FBFF 5600"            /* VÿûùV+Vÿû+VùûÿV. */
		$"2BFB FFFB F956 5656 5656 F9FB FFFB 2B00"            /* +ûÿûùVVVVVùûÿû+. */
	};

	data 'ics4' (kSDKDefIconInfoResourceID, "iconinfo")
	{
		$"000D EEFF FEED 0000 00DE EEDD DEEF E000"            /* .Âîÿþí...ÞîÝÞïà. */
		$"0DEE DCCC CCDE FE00 DEED CCCD CCCD EFD0"            /* ÂîÜÌÌÞþ.ÞíÌÍÌÍïÐ */
		$"EEDC CCCF ECCC DFE0 FEDC CCCD CCCC DEF0"            /* îÜÌÏìÌßàþÜÌÍÌÌÞð */
		$"FEDC CEFF ECCC DEF0 FEDC CCDF ECCC DEF0"            /* þÜÎÿìÌÞðþÜÌßìÌÞð */
		$"FEDC CCDF ECCC DEF0 EEDD CCDF ECCD DFE0"            /* þÜÌßìÌÞðîÝÌßìÍßà */
		$"DEED DCDF ECDD EFD0 0EEE DDDD DDDE FE00"            /* ÞíÜßìÝïÐ.îÝÝÝÞþ. */
		$"00EE EEEE EEEF E000 000D EEFF FFED 0000"            /* .îîîîïà..Âîÿÿí.. */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	};

	data 'ics8' (kSDKDefIconInfoResourceID, "iconinfo")
	{
		$"0000 0056 FBFB FFFF FFFB FB56 0000 0000"            /* ...VûûÿÿÿûûV.... */
		$"0000 F9FB FBFB F9F9 F9FB FBFF FB00 0000"            /* ..ùûûûùùùûûÿû... */
		$"00F9 FBFB 562B 2B2B 2B2B 56FB FFFB 0000"            /* .ùûûV+++++Vûÿû.. */
		$"56FB FB56 2B2B 2BF9 F62B 2B56 FBFF 5600"            /* VûûV+++ùö++VûÿV. */
		$"FBFB F92B 2B2B F8FF FB2B 2B2B F9FF FB00"            /* ûûù+++øÿû+++ùÿû. */
		$"FFFB F92B 2B2B 2B56 F82B 2B2B F9FB FF00"            /* ÿûù++++Vø+++ùûÿ. */
		$"FFFB 562B 2BFB FFFF FB2B 2B2B 56FB FF00"            /* ÿûV++ûÿÿû+++Vûÿ. */
		$"FFFB 562B 2B2B 56FF FB2B 2B2B 56FB FF00"            /* ÿûV+++Vÿû+++Vûÿ. */
		$"FFFB F92B 2B2B 56FF FB2B 2B2B F9FB FF00"            /* ÿûù+++Vÿû+++ùûÿ. */
		$"FBFB F956 2B2B 56FF FB2B 2B56 F9FF FB00"            /* ûûùV++Vÿû++Vùÿû. */
		$"56FB FBF9 562B 56FF FB2B 56F9 FBFF 5600"            /* VûûùV+Vÿû+VùûÿV. */
		$"00FB FBFB F956 5656 5656 F9FB FFFB 0000"            /* .ûûûùVVVVVùûÿû.. */
		$"0000 FBFB FBFB FBFB FBFB FBFF FB00 0000"            /* ..ûûûûûûûûûÿû... */
		$"0000 0056 FBFB FFFF FFFF FB56 0000 0000"            /* ...VûûÿÿÿÿûV.... */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	};

	data 'icl8' (kSDKDefIconInfoResourceID, "iconinfo")
	{
		$"2B2B 2B56 FBFF FFFF FFFF FB56 2B2B 2B00"            /* +++VûÿÿÿÿÿûV+++. */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"2B2B 56FF FBFB F9F9 F9FB FBFF 562B 2B00"            /* ++VÿûûùùùûûÿV++. */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"2B56 FFFB 562B 2BF8 F62B 56FB FF56 2B00"            /* +VÿûV++øö+VûÿV+. */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"56FF FB56 2B2B F8FF FB2B 2B56 FBFF 5600"            /* VÿûV++øÿû++VûÿV. */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"FBFF F92B 2B2B 2B56 F82B 2B2B F9FF FB00"            /* ûÿù++++Vø+++ùÿû. */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"FFFB F92B 2BFB FFFF FB2B 2B2B F9FB FF00"            /* ÿûù++ûÿÿû+++ùûÿ. */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"FFFB 562B 2B2B 56FF FB2B 2B2B 56FB FF00"            /* ÿûV+++Vÿû+++Vûÿ. */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"FFFB 562B 2B2B 56FF FB2B 2B2B 56FB FF00"            /* ÿûV+++Vÿû+++Vûÿ. */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"FFFB F92B 2B2B 56FF FB2B 2B2B F9FB FF00"            /* ÿûù+++Vÿû+++ùûÿ. */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"FBFF F956 2B2B 56FF FB2B 2B56 F9FF FB00"            /* ûÿùV++Vÿû++Vùÿû. */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"56FF FBF9 562B 2B2B 2B2B 56F9 FBFF 5600"            /* VÿûùV+++++VùûÿV. */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"2B56 FFFB F956 5656 5656 F9FB FF56 2B00"            /* +VÿûùVVVVVùûÿV+. */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"2B2B 56FF FBFB FBFB FBFB FBFF 562B 2B00"            /* ++VÿûûûûûûûÿV++. */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"2B2B 2B56 FBFF FFFF FFFF FB56 2B2B 2B00"            /* +++VûÿÿÿÿÿûV+++. */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	};

	data 'icl4' (kSDKDefIconInfoResourceID, "iconinfo")
	{
		$"CCCD EFFF FFED CCC0 0000 0000 0000 0000"            /* ÌÍïÿÿíÌÀ........ */
		$"CCDF EEDD DEEF DCC0 0000 0000 0000 0000"            /* ÌßîÝÞïÜÀ........ */
		$"CDFE DCCC CCDE FDC0 0000 0000 0000 0000"            /* ÍþÜÌÌÞýÀ........ */
		$"DFED CCCF ECCD EFD0 0000 0000 0000 0000"            /* ßíÌÏìÍïÐ........ */
		$"EFDC CCCD CCCC DFE0 0000 0000 0000 0000"            /* ïÜÌÍÌÌßà........ */
		$"FEDC CEFF ECCC DEF0 0000 0000 0000 0000"            /* þÜÎÿìÌÞð........ */
		$"FEDC CCDF ECCC DEF0 0000 0000 0000 0000"            /* þÜÌßìÌÞð........ */
		$"FEDC CCDF ECCC DEF0 0000 0000 0000 0000"            /* þÜÌßìÌÞð........ */
		$"FEDC CCDF ECCC DEF0 0000 0000 0000 0000"            /* þÜÌßìÌÞð........ */
		$"EFDD CCDF ECCD DFE0 0000 0000 0000 0000"            /* ïÝÌßìÍßà........ */
		$"DFED DCCC CCDD EFD0 0000 0000 0000 0000"            /* ßíÜÌÌÝïÐ........ */
		$"CDFE DDDD DDDE FDC0 0000 0000 0000 0000"            /* ÍþÝÝÝÞýÀ........ */
		$"CCDF EEEE EEEF DCC0 0000 0000 0000 0000"            /* ÌßîîîïÜÀ........ */
		$"CCCD EFFF FFED CCC0 0000 0000 0000 0000"            /* ÌÍïÿÿíÌÀ........ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	};

	data 'ICN#' (kSDKDefIconInfoResourceID, "iconinfo")
	{
		$"0FE0 0000 1C70 0000 3018 0000 618C 0000"            /* .à...p..0...aŒ.. */
		$"C006 0000 C786 0000 C186 0000 C186 0000"            /* À...Ç†..Á†..Á†.. */
		$"C186 0000 C186 0000 600C 0000 3018 0000"            /* Á†..Á†..`...0... */
		$"1FF0 0000 0FE0 0000 0000 0000 0000 0000"            /* .ð...à.......... */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"1FF0 0000 3FF8 0000 7FFC 0000 FFFE 0000"            /* .ð..?ø...ü..ÿþ.. */
		$"FFFE 0000 FFFE 0000 FFFE 0000 FFFE 0000"            /* ÿþ..ÿþ..ÿþ..ÿþ.. */
		$"FFFE 0000 FFFE 0000 FFFE 0000 7FFC 0000"            /* ÿþ..ÿþ..ÿþ...ü.. */
		$"3FF8 0000 1FF0 0000 0000 0000 0000 0000"            /* ?ø...ð.......... */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
		$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	};

#endif // else MACINTOSH

// End, Info.r.

