//========================================================================================
//  
//  $File: //depot/devtech/16.0.x/plugin/source/sdksamples/textimportfilter/examplefiles/JIS-long.cpp $
//  
//  Owner: ???
//  
//  $Author: pmbuilder $
//  
//  $DateTime: 2020/11/06 13:08:29 $
//  
//  $Revision: #2 $
//  
//  $Change: 1088580 $
//  
//  Copyright 1997-2010 Adobe Systems Incorporated. All rights reserved.
//  
//  NOTICE:  Adobe permits you to use, modify, and distribute this file in accordance 
//  with the terms of the Adobe license agreement accompanying it.  If you have received
//  this file from a source other than Adobe, then your use, modification, or 
//  distribution of it requires the prior written permission of Adobe.
//  
//========================================================================================

JISの長いファイルです。
中身はShiftJIS-long.cppと殆ど同じですが、文字セットが違うだけのものです。

Aソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Bソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Cソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Dソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Eソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Fソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Gソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Hソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Iソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Jソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Kソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Lソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Mソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Nソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Oソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Pソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Qソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Rソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Sソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Tソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Uソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Vソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Wソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Xソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Yソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Zソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
1ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
2ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
3ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
4ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
5ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
6ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
7ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
8ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
9ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
0ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Aソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Bソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Cソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Dソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Eソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Fソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Gソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Hソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Iソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Jソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Kソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Lソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Mソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Nソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Oソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Pソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Qソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Rソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Sソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Tソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Uソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Vソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Wソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Xソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Yソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Zソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
1ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
2ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
3ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
4ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
5ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
6ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
7ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
8ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
9ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
0ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Aソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Bソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Cソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Dソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Eソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Fソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Gソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Hソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Iソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Jソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Kソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Lソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Mソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Nソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Oソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Pソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Qソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Rソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Sソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Tソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Uソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Vソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Wソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Xソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Yソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
Zソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
1ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
2ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
3ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
4ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
5ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
6ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
7ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
8ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
9ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！
0ソフト表示機能十分！ソフト表示機能十分！ソフト表示機能十分！



